export default  [
    {
      id: 1,
      imageUrl: "https://www.shutterstock.com/image-photo/digital-contents-concept-social-networking-260nw-2164090919.jpg",
      title: "Title 1",
      datePosted: "Date Posted 1",
      postedBy: "Author 1",
      desc:"नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो "
    },
    {
      id: 2,
      imageUrl: "image_url_2",
      title: "Title 2",
      datePosted: "Date Posted 2",
      postedBy: "Author 2",
      desc:"नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो 2"
    
    },
    {
      id: 3,
      imageUrl: "https://www.shutterstock.com/image-photo/digital-contents-concept-social-networking-260nw-2164090919.jpg",
      title: "Title 1",
      datePosted: "Date Posted 1",
      postedBy: "Author 1",
       desc:"नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो नेपाल प्रज्ञा–प्रतिष्ठान नेपालका भाषा, साहित्य, दर्शनशास्त्र, संस्कृति तथा सामाजिक शास्त्रसम्बन्धी अध्ययन, अन्वेषण गर्न, मौलिक सिर्जनात्मक वातावरणको निर्माण गर्न, राष्ट्रका विद्वान एवं प्रतिभाहरुको सम्मान गर्न, सिर्जनात्मक चिन्तन र रचनात्मक कार्यमा जनताको सर्वाङ्गीण सहभागिता जुटाउन राष्ट्रिय एवं अन्तर्राष्ट्रिय स्तरमा प्राज्ञिक गतिविधिको सञ्चालन गर्न स्थापित एक राष्ट्रिय प्रतिष्ठित संस्था हो 3"
    },
    {
      id: 4,
      imageUrl: "image_url_2",
      title: "Title 2",
      datePosted: "Date Posted 2",
      postedBy: "Author 2",
    },
    {
      id: 5,
      imageUrl: "https://www.shutterstock.com/image-photo/digital-contents-concept-social-networking-260nw-2164090919.jpg",
      title: "Title 1",
      datePosted: "Date Posted 1",
      postedBy: "Author 1",
    },
    {
      id: 6,
      imageUrl: "image_url_2",
      title: "Title 2",
      datePosted: "Date Posted 2",
      postedBy: "Author 2",
    },
    {
      id: 7,
      imageUrl: "https://www.shutterstock.com/image-photo/digital-contents-concept-social-networking-260nw-2164090919.jpg",
      title: "Title 1",
      datePosted: "Date Posted 1",
      postedBy: "Author 1",
    },
    {
      id: 8,
      imageUrl: "image_url_2",
      title: "Title 2",
      datePosted: "Date Posted 2",
      postedBy: "Author 2",
    },
 
  ];