import React from 'react'

const Udhyasay = () => {
  return (
    <div className='mx-auto container my-20'>
    <h3 className='text-center text-4xl font-semibold my-10 ]'>उद्देश्य</h3>
    <div className=' mt-10 leading-10'>
      
       <p className="text-justify ">
       पूर्वप्रधानमन्त्री एवं जनआन्दोलनका पिताका रुपमा सुपरिचित टंकप्रसाद आचार्यको नाममा स्थापित यस संस्थाको मुख्य उद्देश्य नेपालको राष्ट्रिय सार्वभौमिकता, क्षेत्रिय अक्ष्क्षुणता, स्वाभिमान र लोकतान्त्रिक मूल्य तथा मान्यताहरूको संरक्षण र प्रवद्र्धन गर्नु तथा देशको सर्वतोमूखि विकासमा सहयोग पुर्याउनु हो । तसर्थ यस प्रतिष्ठानको भौतिक, वित्तिय तथा मानव संसाधन क्षेत्रमा विशेष योगदान हुने गरि आफ्ना क्रियाकलाप संचालन गर्ने गरेको छ । उक्त उद्देश्यको परिपूर्तिका लागि यस संस्थाले विभिन्न कार्यक्रम गर्ने उद्देश्य राखेको छ ।
       </p>
       <ul className="grid grid-cols-3 gap-5">
       <li><h6>(क)</h6> राष्ट्रिय सार्वभौमिकता, क्षेत्रीय अक्ष्क्षुणता, स्वाभिमान र लोकतान्त्रिक मुल्यहरूबारे खोज, सेमिनार, गोष्ठी, प्रशिक्षण तथा प्रतियोगिता आदि गराउने र उक्त विषयमा पुस्तक, पुस्तिका प्रकाशन गराउने ।</li>
       <li><h6>(ख)</h6> यी मूल्य र मान्यतालाई जनता समक्ष पु शिक्षा, सामाजिक उत्थान आर्थिक समुन्नतिको क्षेत्रमा विभिन्न काम गर्ने ।</li>
       <li><h6>(ग)</h6> पुरस्कारद्वारा राष्ट्रिय वा अन्तर्राष्ट्रिय जगतमा जनकल्याण, विकास एवं सम्वर्धनमा गहकिलो योगदान गरेको व्यक्तिलाई सम्मानित गर्ने ।</li>
    </ul>
    </div>
  
 </div>
  )
}

export default Udhyasay